app/controllers/histories_controller.rb

  def index
    @histories = History.all
---
SELECT "histories".* FROM "histories"

  def create
    @history = History.new(history_params)
    @history.user = current_user

    respond_to do |format|
      if @history.save
---
INSERT INTO "histories" ("title", "picture", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Dog"], ["picture", "pexels-photo-731022.jpeg"], ["content", "Sleeping dog"], ["created_at", "2018-12-17 17:34:51.419970"], ["updated_at", "2018-12-17 17:34:51.419970"], ["user_id", 2]]

    def set_history
      @history = History.find(params[:id])
---
SELECT  "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]